Repository: lxd930808/LinguaCast
Catalog: ios/PodcastEnglishStudio/PodcastEnglishStudio/Support/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, ja, ko, pt_br, zh_hans, zh_hant

# settings.legacy_local_pipeline_help
source: These keys are only used by the on-device pipeline. They remain editable here, and switching the generation backend back to On-Device restores the previous behavior.
ar: تُستخدم هذه المفاتيح فقط في خط المعالجة على الجهاز. تظل قابلة للتحرير هنا، وإعادة الواجهة الخلفية للإنشاء إلى «على الجهاز» تستعيد السلوك السابق.
de: Diese Schlüssel werden nur von der On-Device-Pipeline verwendet. Sie bleiben hier bearbeitbar; ein Zurückschalten des Generierungs-Backends auf „Auf dem Gerät“ stellt das frühere Verhalten wieder her.
es: Estas claves solo las usa el pipeline del dispositivo. Siguen siendo editables aquí, y volver a cambiar el backend de generación a En el dispositivo restaura el comportamiento anterior.
fr: Ces clés ne sont utilisées que par le pipeline sur l’appareil. Elles restent modifiables ici, et repasser le backend de génération sur Sur l’appareil restaure le comportement précédent.
ja: これらのキーはオンデバイスパイプラインでのみ使用されます。ここで引き続き編集でき、生成バックエンドをオンデバイスに戻すと以前の動作に復元されます。
ko: 이 키는 기기 내 파이프라인에서만 사용됩니다. 여기에서 계속 편집할 수 있으며, 생성 백엔드를 기기 내로 다시 전환하면 이전 동작이 복원됩니다.
pt_br: Estas chaves são usadas apenas pelo pipeline no dispositivo. Elas continuam editáveis aqui, e voltar o backend de geração para No dispositivo restaura o comportamento anterior.
zh_hans: 这些密钥仅用于设备端流水线。它们仍可在此编辑；将生成后端切换回“设备端”即可恢复之前的行为。
zh_hant: 這些金鑰僅用於裝置端管線。它們仍可在此編輯；將生成後端切換回「裝置端」即可恢復之前的行為。

# settings.local_media_backend
source: Cloud / Local Media Backend
ar: خلفية الوسائط السحابية / المحلية
de: Cloud- / lokales Medien-Backend
es: Backend de medios en la nube / local
fr: Backend média cloud / local
ja: クラウド / ローカルメディアバックエンド
ko: 클라우드 / 로컬 미디어 백엔드
pt_br: Backend de mídia na nuvem / local
zh_hans: 云端 / 本地媒体后端
zh_hant: 雲端 / 本地媒體後端

# settings.local_media_enabled
source: Use yt-dlp media service
ar: استخدام خدمة وسائط yt-dlp
de: yt-dlp-Mediendienst verwenden
es: Usar servicio de medios yt-dlp
fr: Utiliser le service média yt-dlp
ja: yt-dlp メディアサービスを使う
ko: yt-dlp 미디어 서비스 사용
pt_br: Usar serviço de mídia yt-dlp
zh_hans: 使用 yt-dlp 媒体服务
zh_hant: 使用 yt-dlp 媒體服務

# settings.local_media_height
source: Preferred height
ar: الارتفاع المفضّل
de: Bevorzugte Höhe
es: Altura preferida
fr: Hauteur préférée
ja: 希望解像度
ko: 선호 해상도
pt_br: Altura preferida
zh_hans: 首选分辨率
zh_hant: 偏好解析度

# settings.local_media_height.help
source: 720p uses less disk. 1080p is sharper.
ar: 720p يوفر مساحة. 1080p أوضح.
de: 720p braucht weniger Speicher. 1080p ist schärfer.
es: 720p usa menos disco. 1080p es más nítido.
fr: 720p utilise moins d’espace disque. 1080p est plus net.
ja: 720pは容量を節約します。1080pはより鮮明です。
ko: 720p는 용량을 덜 씁니다. 1080p는 더 선명합니다.
pt_br: 720p usa menos disco. 1080p é mais nítido.
zh_hans: 720p 更省磁盘。1080p 更清晰。
zh_hant: 720p 較省磁碟。1080p 更清晰。

# settings.local_media_help
source: Self-hosted yt-dlp backend for HD. Default 720p saves disk. Leave disabled to use on-device extraction.
ar: خلفية yt-dlp ذاتية الاستضافة للوضوح العالي. الافتراضي 720p يوفر المساحة. عند الإيقاف يُستخدم الاستخراج على الجهاز.
de: Selbst gehostetes yt-dlp-Backend für HD. Standard 720p spart Speicher. Aus = Extraktion auf dem Gerät.
es: Backend yt-dlp propio para HD. 720p por defecto ahorra disco. Desactivado = extracción en el dispositivo.
fr: Backend yt-dlp auto-hébergé pour le HD. 720p par défaut pour économiser l’espace. Désactivé = extraction sur l’appareil.
ja: HD 再生用の自前 yt-dlp バックエンド。既定 720p で容量節約。オフで端末内抽出。
ko: HD용 자체 yt-dlp 백엔드. 기본 720p로 디스크 절약. 끄면 기기 내 추출.
pt_br: Backend yt-dlp próprio para HD. 720p por padrão economiza disco. Desativado = extração no dispositivo.
zh_hans: 自建 yt-dlp 后端用于高清播放。默认 720p 节省磁盘。关闭则使用设备端提取。
zh_hant: 自建 yt-dlp 後端用於高畫質播放。預設 720p 節省磁碟。關閉則使用裝置端擷取。

# settings.local_media_mode
source: Mode
ar: الوضع
de: Modus
es: Modo
ja: モード
ko: 모드
pt_br: Modo
zh_hans: 模式
zh_hant: 模式

# settings.local_media_mode.help
source: MP4 downloads a file. HLS streams adaptive video.
ar: MP4 ينزّل ملفًا. HLS يبث فيديو متكيفًا.
de: MP4 lädt eine Datei. HLS streamt adaptives Video.
es: MP4 descarga un archivo. HLS transmite vídeo adaptable.
fr: MP4 télécharge un fichier. HLS diffuse une vidéo adaptative.
ja: MP4はファイルをダウンロードします。HLSは適応ビットレートで配信します。
ko: MP4는 파일을 다운로드합니다. HLS는 적응형 비디오를 스트리밍합니다.
pt_br: MP4 baixa um arquivo. HLS transmite vídeo adaptativo.
zh_hans: MP4 会下载文件。HLS 以自适应方式串流视频。
zh_hant: MP4 會下載檔案。HLS 以自適應方式串流影片。

# settings.local_media_token.help
source: The token is stored on this device and never shown in full.
ar: يُحفظ الرمز على هذا الجهاز ولا يُعرض كاملاً أبدًا.
de: Das Token liegt auf diesem Gerät und wird nie vollständig angezeigt.
es: El token se guarda en este dispositivo y nunca se muestra completo.
fr: Le jeton est stocké sur cet appareil et n’est jamais affiché en entier.
ja: トークンはこのデバイスに保存され、全文は表示されません。
ko: 토큰은 이 기기에 저장되며 전체는 표시되지 않습니다.
pt_br: O token fica neste dispositivo e nunca é exibido por completo.
zh_hans: 令牌保存在此设备上，不会完整显示。
zh_hant: 權杖保存在此裝置上，不會完整顯示。

# settings.local_media_url.help
source: Set the media service URL on iPhone or with Set Up by Phone.
ar: عيّن عنوان خدمة الوسائط على iPhone أو عبر الإعداد بالهاتف.
de: Legen Sie die Medien-URL auf dem iPhone oder unter „Per iPhone einrichten“ fest.
es: Configura la URL del servicio multimedia en el iPhone o con Configurar con el teléfono.
fr: Définissez l’URL du service média sur iPhone ou via Configuration par téléphone.
ja: メディアサービスのURLはiPhoneか「携帯電話で設定」で指定してください。
ko: 미디어 서비스 URL은 iPhone 또는 휴대폰으로 설정에서 지정하세요.
pt_br: Defina o URL do serviço de mídia no iPhone ou em Configurar pelo telefone.
zh_hans: 请在 iPhone 上或通过「用手机配置」设置媒体服务地址。
zh_hant: 請在 iPhone 上或透過「用手機設定」設定媒體服務網址。

# settings.minimax_api_key
source: Minimax API Key
ar: مفتاح Minimax API
de: Minimax API-Schlüssel
es: Clave de Minimax API
fr: Clé API Minimax
ja: Minimax API キー
ko: Minimax API 키
pt_br: Chave da API Minimax
zh_hans: Minimax API 密钥
zh_hant: Minimax API 金鑰

# settings.missing_configuration_count
source: %lld configuration items remaining
ar: بقي %lld عنصر إعداد
de: Noch %lld Konfigurationselemente
es: Faltan %lld elementos de configuración
fr: Il reste %lld éléments de configuration
ja: 残りの設定項目：%lld 件
ko: 남은 구성 항목 %lld개
pt_br: Faltam %lld itens de configuração
zh_hans: 还需完成 %lld 项配置
zh_hant: 尚需完成 %lld 項設定

# settings.mobile_setup
source: Set Up by Phone
ar: الإعداد بالهاتف
de: Mit Telefon einrichten
es: Configurar con el teléfono
fr: Configurer par téléphone
ja: スマートフォンで設定
ko: 휴대폰으로 설정
pt_br: Configurar pelo celular
zh_hans: 手机扫码
zh_hant: 手機設定

# settings.model_id
source: Model ID
ar: معرّف النموذج
de: Modell-ID
es: ID del modelo
fr: ID du modèle
ja: モデル ID
ko: 모델 ID
pt_br: ID do modelo
zh_hans: 模型 ID
zh_hant: 模型 ID

# settings.needs_attention
source: Needs attention
ar: يحتاج انتباهاً
de: Handlung nötig
es: Requiere atención
fr: À traiter
ja: 要確認
ko: 확인 필요
pt_br: Precisa de atenção
zh_hans: 需要处理
zh_hant: 需要處理

# settings.no_changes
source: No settings changed.
ar: لم تتغير الإعدادات.
de: Keine Einstellungen geändert.
es: No se cambió ningún ajuste.
fr: Aucun réglage modifié.
ja: 設定は変更されていません。
ko: 변경된 설정이 없습니다.
pt_br: Nenhum ajuste foi alterado.
zh_hans: 设置没有变化。
zh_hant: 設定沒有變更。

# settings.none
source: None
ar: لا شيء
de: Keine
es: Ninguno
fr: Aucun
ja: なし
ko: 없음
pt_br: Nenhum
zh_hans: 无
zh_hant: 無

# settings.not_configured
source: Not configured
ar: غير مُعدّ
de: Nicht konfiguriert
es: No configurado
fr: Non configuré
ja: 未設定
ko: 구성되지 않음
pt_br: Não configurado
zh_hans: 未配置
zh_hant: 未設定

# settings.optional_tts
source: Optional TTS
ar: تحويل النص إلى كلام اختياري
de: Optionales TTS
es: TTS opcional
fr: TTS en option
ja: オプションの TTS
ko: 선택적 TTS
pt_br: TTS opcional
zh_hans: 可选 TTS
zh_hant: 可選 TTS

# settings.oss.help
source: Transcribed audio is uploaded to DashScope first. OSS is kept for later backup.
ar: يُرفع الصوت المفرّغ إلى DashScope أولاً. يُبقى OSS للنسخ الاحتياطي لاحقًا.
de: Transkribiertes Audio wird zuerst zu DashScope hochgeladen. OSS bleibt für spätere Backups.
es: El audio transcrito se sube primero a DashScope. OSS se reserva para copias posteriores.
fr: L’audio transcrit est d’abord envoyé vers DashScope. OSS est conservé pour une sauvegarde ultérieure.
ja: 書き起こし音声は先にDashScopeへアップロードされます。OSSは後のバックアップ用です。
ko: 전사 오디오는 먼저 DashScope로 올라갑니다. OSS는 이후 백업용입니다.
pt_br: O áudio transcrito é enviado primeiro ao DashScope. O OSS fica para backup posterior.
zh_hans: 转写音频会先上传到 DashScope。OSS 仅保留供后续备份。
zh_hant: 轉寫音訊會先上傳到 DashScope。OSS 僅保留供後續備份。

# settings.provider
source: Provider
ar: موفر الخدمة
de: Anbieter
es: Proveedor
fr: Fournisseur
ja: プロバイダ
ko: 제공업체
pt_br: Provedor
zh_hans: 服务商
zh_hant: 服務提供者

# settings.provider.help
source: The on-device translation provider. Change it on iPhone.
ar: موفّر الترجمة على الجهاز. غيّره على iPhone.
de: Der Übersetzungsanbieter auf dem Gerät. Ändern Sie ihn auf dem iPhone.
es: El proveedor de traducción en el dispositivo. Cámbialo en el iPhone.
fr: Le fournisseur de traduction sur l’appareil. Modifiez-le sur iPhone.
ja: オンデバイス翻訳プロバイダです。iPhoneで変更してください。
ko: 기기 내 번역 제공업체입니다. iPhone에서 변경하세요.
pt_br: O provedor de tradução no dispositivo. Altere no iPhone.
zh_hans: 本机翻译服务商。请在 iPhone 上更改。
zh_hant: 本機翻譯服務商。請在 iPhone 上更改。

# settings.reasoning_effort
source: Reasoning Effort
ar: مستوى الاستدلال
de: Denkaufwand
es: Nivel de razonamiento
fr: Niveau de raisonnement
ja: 推論レベル
ko: 추론 수준
pt_br: Nível de raciocínio
zh_hans: 推理强度
zh_hant: 推理強度

# settings.reasoning_high
source: High
ar: مرتفع
de: Hoch
es: Alto
fr: Élevé
ja: 高
ko: 높음
pt_br: Alto
zh_hans: 高
zh_hant: 高

# settings.reasoning_low
source: Low
ar: منخفض
de: Niedrig
es: Bajo
fr: Faible
ja: 低
ko: 낮음
pt_br: Baixo
zh_hans: 低
zh_hant: 低

# settings.reasoning_max
source: Max
ar: الحد الأقصى
de: Maximum
es: Máximo
fr: Maximum
ja: 最大
ko: 최대
pt_br: Máximo
zh_hans: 最高
zh_hant: 最高

# settings.reasoning_medium
source: Medium
ar: متوسط
de: Mittel
es: Medio
fr: Moyen
ja: 中
ko: 보통
pt_br: Médio
zh_hans: 中
zh_hant: 中

# settings.reasoning_minimal
source: Minimal
ar: الحد الأدنى
es: Mínimo
ja: 最小
ko: 최소
pt_br: Mínimo
zh_hans: 最小
zh_hant: 最小

# settings.reasoning_none
source: None
ar: بدون
de: Keine
es: Ninguno
fr: Aucun
ja: なし
ko: 없음
pt_br: Nenhum
zh_hans: 无
zh_hant: 無

# settings.reasoning_xhigh
source: Extra High
ar: مرتفع جداً
de: Extra hoch
es: Extra alto
fr: Extra élevé
ja: 最高
ko: 매우 높음
pt_br: Extra alto
zh_hans: 极高
zh_hant: 極高

# settings.region
source: Region
ar: المنطقة
es: Región
fr: Région
ja: リージョン
ko: 리전
pt_br: Região
zh_hans: 区域
zh_hant: 區域

# settings.root.help
source: Choose a category. Changes apply immediately and sync with iCloud when available.
ar: اختر فئة. تُطبَّق التغييرات فورًا وتُزامَن مع iCloud عند التوفر.
de: Wählen Sie eine Kategorie. Änderungen gelten sofort und werden mit iCloud synchronisiert, wenn verfügbar.
es: Elige una categoría. Los cambios se aplican al instante y se sincronizan con iCloud si está disponible.
fr: Choisissez une catégorie. Les modifications s’appliquent immédiatement et se synchronisent avec iCloud si disponible.
ja: カテゴリを選びます。変更はすぐに反映され、可能ならiCloudと同期されます。
ko: 카테고리를 선택하세요. 변경은 바로 적용되며 가능하면 iCloud와 동기화됩니다.
pt_br: Escolha uma categoria. As alterações valem na hora e sincronizam com o iCloud quando disponível.
zh_hans: 选择一个分类。更改会立即生效，并在可用时与 iCloud 同步。
zh_hant: 選擇一個分類。變更會立即生效，並在可用時與 iCloud 同步。

# settings.saved_sync_pending
source: Settings saved and waiting for iCloud sync.
ar: تم حفظ الإعدادات وهي بانتظار مزامنة iCloud.
de: Einstellungen gespeichert; iCloud-Synchronisierung ausstehend.
es: Ajustes guardados; esperando la sincronización con iCloud.
fr: Réglages enregistrés, en attente de synchronisation iCloud.
ja: 設定を保存しました。iCloud同期を待機しています。
ko: 설정을 저장했으며 iCloud 동기화를 기다리는 중입니다.
pt_br: Ajustes salvos, aguardando a sincronização do iCloud.
zh_hans: 设置已保存并等待 iCloud 同步。
zh_hant: 設定已儲存並等待 iCloud 同步。

# settings.setup_item_missing.help
source: Configure this key on iPhone or with Set Up by Phone.
ar: أعدّ هذا المفتاح على iPhone أو عبر الإعداد بالهاتف.
de: Richten Sie diesen Schlüssel auf dem iPhone oder unter „Per iPhone einrichten“ ein.
es: Configura esta clave en el iPhone o con Configurar con el teléfono.
fr: Configurez cette clé sur iPhone ou via Configuration par téléphone.
ja: このキーはiPhoneか「携帯電話で設定」で設定してください。
ko: 이 키는 iPhone 또는 휴대폰으로 설정에서 구성하세요.
pt_br: Configure esta chave no iPhone ou em Configurar pelo telefone.
zh_hans: 请在 iPhone 上或通过「用手机配置」设置此密钥。
zh_hant: 請在 iPhone 上或透過「用手機設定」設定此金鑰。

# settings.setup_item_ready.help
source: This key is configured.
ar: هذا المفتاح مُعدّ.
de: Dieser Schlüssel ist konfiguriert.
es: Esta clave está configurada.
fr: Cette clé est configurée.
ja: このキーは設定済みです。
ko: 이 키가 구성되어 있습니다.
pt_br: Esta chave está configurada.
zh_hans: 此密钥已配置。
zh_hant: 此金鑰已設定。

# settings.small
source: Small
ar: صغير
de: klein
es: pequeño
fr: petit
ja: 小さい
ko: 작은
pt_br: pequeno
zh_hans: 小
zh_hant: 小

# settings.standard
source: Standard
ar: قياسي
es: Estándar
fr: Norme
ja: 標準
ko: 표준
pt_br: Padrão
zh_hans: 标准
zh_hant: 標準

# settings.subtitle_english_size
source: English Size
ar: حجم الإنجليزية
de: Englischgröße
es: Tamaño del inglés
fr: Taille de l’anglais
ja: 英語サイズ
ko: 영어 크기
pt_br: Tamanho do inglês
zh_hans: 英文字号
zh_hant: 英文字級

# settings.subtitle_english_size_help
source: English subtitle size from level 1 (smallest) to 9 (largest).
ar: حجم الترجمة الإنجليزية من المستوى 1 (الأصغر) إلى 9 (الأكبر).
de: Größe der englischen Untertitel von Stufe 1 (kleinste) bis 9 (größte).
es: Tamaño de los subtítulos en inglés del nivel 1 (más pequeño) al 9 (más grande).
fr: Taille des sous-titres anglais, du niveau 1 (plus petit) au 9 (plus grand).
ja: 英語字幕のサイズ。レベル1（最小）から9（最大）まで。
ko: 영어 자막 크기. 레벨 1(가장 작음)부터 9(가장 큼)까지.
pt_br: Tamanho das legendas em inglês do nível 1 (menor) ao 9 (maior).
zh_hans: 英文字幕字号，从 1（最小）到 9（最大）。
zh_hant: 英文字幕字級，從 1（最小）到 9（最大）。

# settings.subtitle_english_size_value
source: Level %d, %@
ar: المستوى %d، %@
de: Stufe %d, %@
es: Nivel %d, %@
fr: Niveau %d, %@
ja: レベル%d、%@
ko: 레벨 %d, %@
pt_br: Nível %d, %@
zh_hans: 级别 %d，%@
zh_hant: 等級 %d，%@

# settings.subtitle_min_size_hint
source: Translation size is raised to the platform minimum for readability.
ar: يتم رفع حجم الترجمة إلى الحد الأدنى للمنصة لسهولة القراءة.
de: Die Übersetzungsgröße wird für die Lesbarkeit auf das Plattformminimum angehoben.
es: El tamaño de la traducción se eleva al mínimo de la plataforma para mejorar la legibilidad.
fr: La taille de la traduction est relevée au minimum de la plateforme pour la lisibilité.
ja: 読みやすさのため、訳文サイズはプラットフォームの最小値まで引き上げられます。
ko: 가독성을 위해 번역 크기가 플랫폼 최소값으로 올라갑니다.
pt_br: O tamanho da tradução é elevado ao mínimo da plataforma para legibilidade.
zh_hans: 为确保可读性，译文大小已提升到平台最小值。
zh_hant: 為確保可讀性，譯文大小已提升到平台最小值。

# settings.subtitle_order
source: Line Order
ar: ترتيب الأسطر
de: Zeilenreihenfolge
es: Orden de líneas
fr: Ordre des lignes
ja: 行の順序
ko: 줄 순서
pt_br: Ordem das linhas
zh_hans: 行序
zh_hant: 行序

# settings.subtitle_order_english_first
source: English first
ar: الإنجليزية أولاً
de: Englisch zuerst
es: Inglés primero
fr: Anglais d’abord
ja: 英語が上
ko: 영어 먼저
pt_br: Inglês primeiro
zh_hans: 英语在上
zh_hant: 英語在上

# settings.subtitle_order_help
source: Choose which language appears on the top line.
ar: اختر اللغة التي تظهر في السطر العلوي.
de: Wählen Sie, welche Sprache in der oberen Zeile erscheint.
es: Elige qué idioma aparece en la línea superior.
fr: Choisissez la langue affichée sur la ligne du haut.
ja: 上の行に表示する言語を選びます。
ko: 위쪽 줄에 표시할 언어를 선택하세요.
pt_br: Escolha qual idioma aparece na linha de cima.
zh_hans: 选择哪一行语言显示在上方。
zh_hant: 選擇哪一行語言顯示在上方。

# settings.subtitle_order_target_first
source: %@ first
ar: %@ أولاً
de: %@ zuerst
es: %@ primero
fr: %@ d’abord
ja: %@が上
ko: %@ 먼저
pt_br: %@ primeiro
zh_hans: %@ 在上
zh_hant: %@ 在上

# settings.subtitle_preview
source: Preview
ar: معاينة
de: Vorschau
es: Vista previa
fr: Aperçu
ja: プレビュー
ko: 미리보기
pt_br: Prévia
zh_hans: 预览
zh_hant: 預覽

# settings.subtitle_size
source: Subtitle Size
ar: حجم الترجمة
de: Untertitelgröße
es: Tamaño de subtítulos
fr: Taille des sous-titres
ja: 字幕サイズ
ko: 자막 크기
pt_br: Tamanho das legendas
zh_hans: 字幕字体大小
zh_hant: 字幕大小

# settings.subtitle_target
source: Subtitle Translation Language
ar: لغة ترجمة النص
de: Übersetzungssprache der Untertitel
es: Idioma de traducción de subtítulos
fr: Langue de traduction des sous-titres
ja: 字幕の翻訳言語
ko: 자막 번역 언어
pt_br: Idioma de tradução das legendas
zh_hans: 字幕目标语言
zh_hant: 字幕目標語言

# settings.subtitle_target_help
source: New subtitles use this language. Existing translations remain available on this device.
ar: تستخدم الترجمات الجديدة هذه اللغة. تبقى الترجمات الحالية متاحة على هذا الجهاز.
de: Neue Untertitel verwenden diese Sprache. Vorhandene Übersetzungen bleiben auf diesem Gerät verfügbar.
es: Los subtítulos nuevos usarán este idioma. Las traducciones existentes seguirán disponibles en este dispositivo.
fr: Les nouveaux sous-titres utilisent cette langue. Les traductions existantes restent disponibles sur cet appareil.
ja: 新しい字幕にはこの言語が使われます。既存の翻訳はこのデバイスに保持されます。
ko: 새 자막은 이 언어를 사용합니다. 기존 번역은 이 기기에 계속 보관됩니다.
pt_br: Novas legendas usarão este idioma. As traduções existentes continuarão disponíveis neste dispositivo.
zh_hans: 新字幕使用此目标语言；已生成译文会继续保留在本机。
zh_hant: 新字幕使用此目標語言；已產生的譯文會繼續保留在本機。

# settings.subtitle_target_scale
source: Translation Size
ar: حجم الترجمة
de: Übersetzungsgröße
es: Tamaño de la traducción
fr: Taille de la traduction
ja: 訳文サイズ
ko: 번역 크기
pt_br: Tamanho da tradução
zh_hans: 译文大小
zh_hant: 譯文大小

# settings.subtitle_target_scale_help
source: Translation size as a percentage of English size. Current translation language: %@.
ar: حجم الترجمة كنسبة مئوية من حجم الإنجليزية. لغة الترجمة الحالية: %@.
de: Übersetzungsgröße als Prozentanteil der Englischgröße. Aktuelle Übersetzungssprache: %@.
es: Tamaño de la traducción como porcentaje del inglés. Idioma de traducción actual: %@.
fr: Taille de la traduction en pourcentage de la taille anglaise. Langue de traduction actuelle : %@.
ja: 訳文サイズは英語サイズに対する割合です。現在の翻訳言語: %@。
ko: 번역 크기는 영어 크기의 비율입니다. 현재 번역 언어: %@.
pt_br: Tamanho da tradução como porcentagem do inglês. Idioma de tradução atual: %@.
zh_hans: 译文大小相对英文字号的百分比。当前目标语言：%@。
zh_hant: 譯文大小相對英文字級的百分比。目前目標語言：%@。

# settings.subtitles
source: Subtitles
ar: الترجمة
de: Untertitel
es: Subtítulos
fr: Sous-titres
ja: 字幕
ko: 자막
pt_br: Legendas
zh_hans: 字幕
zh_hant: 字幕

# settings.subtitles.help
source: English size, translation size, and line order.
ar: حجم الإنجليزية وحجم الترجمة وترتيب الأسطر.
de: Englische Größe, Übersetzungsgröße und Zeilenreihenfolge.
es: Tamaño del inglés, tamaño de la traducción y orden de las líneas.
fr: Taille de l’anglais, taille de la traduction et ordre des lignes.
ja: 英語サイズ、訳文サイズ、行の順序です。
ko: 영어 크기, 번역 크기, 줄 순서입니다.
pt_br: Tamanho do inglês, tamanho da tradução e ordem das linhas.
zh_hans: 英文大小、译文大小与行顺序。
zh_hant: 英文大小、譯文大小與行順序。

# settings.sync_now
source: Sync now
ar: مزامنة الآن
de: Jetzt synchronisieren
es: Sincronizar ahora
fr: Synchronisez maintenant
ja: 今すぐ同期する
ko: 지금 동기화
pt_br: Sincronize agora
zh_hans: 立即同步
zh_hant: 立即同步

# settings.sync_now.help
source: Upload and download the latest settings and subtitles.
ar: رفع وتنزيل أحدث الإعدادات والترجمات.
de: Neueste Einstellungen und Untertitel hoch- und herunterladen.
es: Sube y descarga los últimos ajustes y subtítulos.
fr: Téléverser et télécharger les derniers réglages et sous-titres.
ja: 最新の設定と字幕をアップロード／ダウンロードします。
ko: 최신 설정과 자막을 올리고 받습니다.
pt_br: Enviar e baixar os ajustes e legendas mais recentes.
zh_hans: 上传并下载最新的设置与字幕。
zh_hant: 上傳並下載最新的設定與字幕。

# settings.sync_unavailable.help
source: Sign in to iCloud on this Apple TV to sync.
ar: سجّل الدخول إلى iCloud على Apple TV هذا للمزامنة.
de: Melden Sie sich auf diesem Apple TV bei iCloud an, um zu synchronisieren.
es: Inicia sesión en iCloud en este Apple TV para sincronizar.
fr: Connectez-vous à iCloud sur cet Apple TV pour synchroniser.
ja: このApple TVでiCloudにサインインすると同期できます。
ko: 이 Apple TV에서 iCloud에 로그인하면 동기화됩니다.
pt_br: Entre no iCloud neste Apple TV para sincronizar.
zh_hans: 在此 Apple TV 上登录 iCloud 后即可同步。
zh_hant: 在此 Apple TV 上登入 iCloud 後即可同步。

# settings.sync_unavailable_tests
source: Sync is disabled during UI tests.
ar: المزامنة متوقفة أثناء اختبارات الواجهة.
de: Die Synchronisierung ist während UI-Tests deaktiviert.
es: La sincronización está desactivada durante las pruebas de IU.
fr: La synchronisation est désactivée pendant les tests d’interface.
ja: UIテスト中は同期が無効です。
ko: UI 테스트 중에는 동기화가 꺼집니다.
pt_br: A sincronização fica desativada durante os testes de IU.
zh_hans: UI 测试期间已禁用同步。
zh_hant: UI 測試期間已停用同步。

# settings.the_first_version_does_not_generate_chinese_synthesized_episodes
source: The first version does not generate Chinese synthesized episodes by default, and this configuration is retained for subsequent TTS.
ar: لا يقوم الإصدار الأول بإنشاء حلقات مركبة صينية بشكل افتراضي، ويتم الاحتفاظ بهذا التكوين لتحويل النص إلى كلام (TTS) اللاحق.
de: Die erste Version generiert standardmäßig keine chinesisch synthetisierten Episoden und diese Konfiguration wird für nachfolgende TTS beibehalten.
es: La primera versión no genera episodios sintetizados en chino de forma predeterminada y esta configuración se conserva para TTS posteriores.
fr: La première version ne génère pas d'épisodes synthétisés chinois par défaut, et cette configuration est conservée pour les TTS suivants.
ja: 最初のバージョンでは、デフォルトでは中国語の合成エピソードが生成されず、この構成は後続の TTS でも保持されます。
ko: 첫 번째 버전은 기본적으로 중국어 합성 에피소드를 생성하지 않으며 이 구성은 후속 TTS에도 유지됩니다.
pt_br: A primeira versão não gera episódios sintetizados em chinês por padrão, e esta configuração é mantida para TTS subsequentes.
zh_hans: 首版默认不生成中文合成整集，保留此配置用于后续 TTS。
zh_hant: 首版預設不產生中文合成整集，保留此配置用於後續 TTS。

# settings.transcribed_audio_is_now_uploaded_to_dashscope_for_temporary_sto
source: Transcribed audio is now uploaded to DashScope for temporary storage first, and the OSS configuration is only retained for subsequent backup.
ar: يتم الآن تحميل الصوت المكتوب إلى DashScope للتخزين المؤقت أولاً، ويتم الاحتفاظ بتكوين OSS فقط للنسخ الاحتياطي اللاحق.
de: Transkribiertes Audio wird jetzt zunächst zur temporären Speicherung auf DashScope hochgeladen und die OSS-Konfiguration bleibt nur für spätere Sicherungen erhalten.
es: El audio transcrito ahora se carga primero en DashScope para su almacenamiento temporal y la configuración de OSS solo se conserva para una copia de seguridad posterior.
fr: L'audio transcrit est désormais téléchargé d'abord sur DashScope pour un stockage temporaire, et la configuration OSS n'est conservée que pour une sauvegarde ultérieure.
ja: 文字起こしされた音声は、最初に一時ストレージとして DashScope にアップロードされるようになり、OSS 設定は後続のバックアップのためにのみ保持されます。
ko: 이제 스크립트된 오디오는 먼저 임시 저장을 위해 DashScope에 업로드되며, OSS 구성은 후속 백업을 위해서만 유지됩니다.
pt_br: O áudio transcrito agora é carregado primeiro em DashScope para armazenamento temporário, e a configuração do OSS é retida apenas para backup subsequente.
zh_hans: 转写音频现在优先上传到 DashScope 临时存储，OSS 配置仅保留作后续备用。
zh_hant: 轉寫音訊現在優先上傳到 DashScope 暫存，OSS 配置僅保留作後續備用。

# settings.translation
source: Translation
ar: الترجمة
de: Übersetzung
es: Traducción
fr: Traduction
ja: 翻訳
ko: 번역
pt_br: Tradução
zh_hans: 翻译
zh_hant: 翻譯

# settings.translation.help
source: Translation quality and the current subtitle language.
ar: جودة الترجمة ولغة الترجمة الحالية.
de: Übersetzungsqualität und aktuelle Untertitelsprache.
es: Calidad de traducción e idioma actual de los subtítulos.
fr: Qualité de traduction et langue actuelle des sous-titres.
ja: 翻訳品質と現在の字幕言語です。
ko: 번역 품질과 현재 자막 언어입니다.
pt_br: Qualidade da tradução e idioma atual das legendas.
zh_hans: 翻译质量与当前字幕语言。
zh_hant: 翻譯品質與目前字幕語言。

# settings.translation_api_key
source: Translation API Key
ar: مفتاح API للترجمة
de: Übersetzungs-API-Schlüssel
es: Clave de API de traducción
fr: Clé API de traduction
ja: 翻訳 API キー
ko: 번역 API 키
pt_br: Chave da API de tradução
zh_hans: 翻译 API 密钥
zh_hant: 翻譯 API 金鑰
